[
  {
    "date": "2025-06-15",
    "name": "Ayesha Rahman",
    "role": "Donor",
    "rating": 4.9,
    "quote": "As a long-time donor, I've contributed to many causes, but this initiative truly stands out. From detailed progress updates to clear breakdowns of where each taka goes, their level of transparency is exceptional. Knowing exactly how my contributions are making an impact — whether it's providing winter kits or funding mobile clinics — makes me proud to be a part of this movement. It’s why I now donate every month without hesitation.",
    "image": "https://images.unsplash.com/photo-1573496359142-b8d87734a5a2?w=400"
  },
  {
    "date": "2025-05-22",
    "name": "Jamil Hossain",
    "role": "Beneficiary",
    "rating": 5.0,
    "quote": "Last winter was brutal. As a father of three with unstable income, I was deeply worried about how we’d survive the cold. But thanks to the donation program, my family received warm coats and blankets just in time. It wasn’t just clothing — it was safety, warmth, and dignity. That single act of kindness meant everything to us, and we’re forever grateful to the people behind this program.",
    "image": "https://images.unsplash.com/photo-1500648767791-00dcc994a43e?w=400"
  },
  {
    "date": "2025-07-01",
    "name": "Priya Saha",
    "role": "Volunteer",
    "rating": 4.8,
    "quote": "I joined as a volunteer not knowing what to expect — but it turned into one of the most transformative experiences of my life. We traveled to distant, often overlooked villages where children were shivering in thin clothes. Handing them warm jackets, hearing their laughter, and seeing hope light up their faces reminded me why giving back matters. This initiative connects hearts, not just hands.",
    "image": "https://images.unsplash.com/photo-1554151228-14d9def656e4?w=400"
  },
  {
    "date": "2025-06-28",
    "name": "Dr. Rezwan Khan",
    "role": "Medical Partner",
    "rating": 5.0,
    "quote": "As a physician working in rural clinics, I've seen firsthand how devastating winter can be for underserved communities. Before this program, we treated hundreds for pneumonia and other cold-related conditions each year. But last winter, with timely distribution of warm clothing and awareness efforts, we saw a 40% drop in such cases. This isn’t just charity — it’s preventive healthcare in action.",
    "image": "https://images.unsplash.com/photo-1519085360753-af0119f7cbe7?w=400"
  },
  {
    "date": "2025-06-10",
    "name": "Nusrat Jahan",
    "role": "School Teacher",
    "rating": 4.7,
    "quote": "I teach in a school where most children come from low-income families. Every winter, attendance drops and students struggle to focus — not due to lack of interest, but sheer discomfort. This winter, after receiving jackets and warm gear from the campaign, everything changed. The kids were energetic, more attentive, and even enjoyed coming to school. Warmth brought back their smiles — and their dreams.",
    "image": "https://images.unsplash.com/photo-1580489944761-15a19d654956?w=400"
  },
  {
    "date": "2025-07-03",
    "name": "Rafiqul Islam",
    "role": "Local Business Owner",
    "rating": 4.9,
    "quote": "As a local business owner, I always believed in giving back to the community. Sponsoring 50 blankets through this initiative was a proud moment for me — but what touched me most was visiting the distribution site and witnessing the joy and relief on people’s faces. Knowing that my small contribution made such a big difference has inspired me to do even more in the future.",
    "image": "https://images.unsplash.com/photo-1566492031773-4f4e44671857?w=400"
  }
]
